# Introduction
Sprocket Central Pty Ltd , a medium size bikes & cycling accessories organisation, has approached Tony Smith (Partner) in KPMG’s Lighthouse & Innovation Team. Sprocket Central Pty Ltd  is keen to learn more about KPMG’s expertise in its Analytics, Information & Modelling team. 

Primarily, Sprocket Central Pty Ltd needs help with its customer and transactions data. The organisation has a large dataset relating to its customers, but their team is unsure how to effectively analyse it to help optimise its marketing strategy. 

However, in order to support the analysis, you speak to the Associate Director for some ideas and she advised that “the importance of optimising the quality of customer datasets cannot be underestimated. The better the quality of the dataset, the better chance you will be able to use it drive company growth.”

### Libraries & Packages Importing

In [ ]:
# Data analysis and wragling
import pandas as pd
import numpy as np


# Statistics
from statistics import stdev
from scipy.stats import t

### Data Loading and Processing

In [ ]:
#Importing & Mounting google drive
from google.colab import drive
drive.mount('/content/drive/')

Mounted at /content/drive/

In [ ]:
transactions = pd.read_excel('/content/drive/My Drive/Dataset/kpmg_dataset.xlsx', sheet_name='Transactions',header=1)
customer = pd.read_excel('/content/drive/My Drive/Dataset/kpmg_dataset.xlsx', sheet_name='NewCustomerList',header=1)
customer_demo = pd.read_excel('/content/drive/My Drive/Dataset/kpmg_dataset.xlsx', sheet_name='CustomerDemographic',header=1)
customer_address = pd.read_excel('/content/drive/My Drive/Dataset/kpmg_dataset.xlsx', sheet_name='CustomerAddress',header=1)

<ipython-input-3-5e1ff6fc6c58>:2: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype={value.dtype})
  customer = pd.read_excel('/content/drive/My Drive/Dataset/kpmg_dataset.xlsx', sheet_name='NewCustomerList',header=1)
<ipython-input-3-5e1ff6fc6c58>:3: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype={value.dtype})
  customer_demo = pd.read_excel('/content/drive/My Drive/Dataset/kpmg_dataset.xlsx', sheet_name='CustomerDemographic',header=1)

## TRANSACTION TABLE ANALYSIS

In [ ]:
transactions.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

In [ ]:
transactions.shape

(20000, 13)

In [ ]:
# Check for missing values
print("Missing values:")
print(transactions.isnull().sum())

Missing values:
transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

We do have a lot of missing values in the online order column, the brand, product line, product class and product class. Also standard xost and product first sold date

In [ ]:
# Check for duplicate rows
print("\nDuplicate rows:")
print(transactions.duplicated().sum())

Duplicate rows:
0

No duplicated rows

In [ ]:
# Check the data types of each column
print("\nData types:")
print(transactions.dtypes)

Data types:
transaction_id                      int64
product_id                          int64
customer_id                         int64
transaction_date           datetime64[ns]
online_order                      float64
order_status                       object
brand                              object
product_line                       object
product_class                      object
product_size                       object
list_price                        float64
standard_cost                     float64
product_first_sold_date           float64
dtype: object

product_first_sold_date is a date, so the data type here should not be float, it should be datetime

In [ ]:
# Convert the product_first_sold_date column to a datetime format
transactions['product_first_sold_date'] = pd.to_datetime(transactions['product_first_sold_date'])

# Verify that the datatype has been changed
print(transactions['product_first_sold_date'].dtypes)

datetime64[ns]

In [ ]:
# Check for unique values in each column
print("\nUnique values:")
for column in transactions.columns:
    print(f"Column: {column}, Unique values: {transactions[column].nunique()}")

Unique values:
Column: transaction_id, Unique values: 20000
Column: product_id, Unique values: 101
Column: customer_id, Unique values: 3494
Column: transaction_date, Unique values: 364
Column: online_order, Unique values: 2
Column: order_status, Unique values: 2
Column: brand, Unique values: 6
Column: product_line, Unique values: 4
Column: product_class, Unique values: 3
Column: product_size, Unique values: 3
Column: list_price, Unique values: 296
Column: standard_cost, Unique values: 103
Column: product_first_sold_date, Unique values: 100

In [ ]:
#Value counts
for column in transactions.columns:
    value_counts = transactions[column].value_counts()
    print(f"Column: {column}")
    print(value_counts)

Column: transaction_id
1        1
13331    1
13338    1
13337    1
13336    1
        ..
6667     1
6666     1
6665     1
6664     1
20000    1
Name: transaction_id, Length: 20000, dtype: int64
Column: product_id
0      1378
3       354
1       311
35      268
38      267
       ...
71      137
8       136
16      136
100     130
47      121
Name: product_id, Length: 101, dtype: int64
Column: customer_id
2183    14
2476    14
1068    14
1672    13
2912    13
        ..
898      1
2352     1
1846     1
3279     1
1757     1
Name: customer_id, Length: 3494, dtype: int64
Column: transaction_date
2017-02-14    82
2017-08-18    82
2017-10-15    76
2017-01-31    73
2017-12-19    71
              ..
2017-01-12    38
2017-12-07    37
2017-03-29    36
2017-09-25    35
2017-10-19    32
Name: transaction_date, Length: 364, dtype: int64
Column: online_order
1.0    9829
0.0    9811
Name: online_order, dtype: int64
Column: order_status
Approved     19821
Cancelled      179
Name: order_status, dtype: int64
Column: brand
Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64
Column: product_line
Standard    14176
Road         3970
Touring      1234
Mountain      423
Name: product_line, dtype: int64
Column: product_class
medium    13826
high       3013
low        2964
Name: product_class, dtype: int64
Column: product_size
medium    12990
large      3976
small      2837
Name: product_size, dtype: int64
Column: list_price
2091.47    465
1403.50    396
71.49      274
1231.15    235
1890.39    233
          ...
56.21        1
126.36       1
1300.96      1
1697.27      1
867.92       1
Name: list_price, Length: 296, dtype: int64
Column: standard_cost
388.920000    465
954.820000    396
53.620000     274
161.600000    235
260.140000    233
             ...
151.960000    124
206.350000    114
312.735016      1
270.299988      1
667.400024      1
Name: standard_cost, Length: 103, dtype: int64
Column: product_first_sold_date
1970-01-01 00:00:00.000033879    234
1970-01-01 00:00:00.000041064    229
1970-01-01 00:00:00.000037823    227
1970-01-01 00:00:00.000039880    222
1970-01-01 00:00:00.000038216    220
                                ...
1970-01-01 00:00:00.000041848    169
1970-01-01 00:00:00.000042404    168
1970-01-01 00:00:00.000041922    166
1970-01-01 00:00:00.000037659    163
1970-01-01 00:00:00.000034586    162
Name: product_first_sold_date, Length: 100, dtype: int64

## Customer Demographic

In [15]:
customer_demo.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0

In [16]:
customer_demo.shape

(4000, 13)

In [17]:
# Check for missing values
print("Missing values:")
print(customer_demo.isnull().sum())

Missing values:
customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
dtype: int64

Couple of missing values in the last-name, DOB, Job title, Job industry category, the deault column should be dropped and tenure

In [18]:
# Check for duplicate rows
print("\nDuplicate rows:")
print(customer_demo.duplicated().sum())

Duplicate rows:
0

In [19]:
# Check the data types of each column
print("\nData types:")
print(customer_demo.dtypes)

Data types:
customer_id                                     int64
first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
default                                        object
owns_car                                       object
tenure                                        float64
dtype: object

In [20]:
# Check for unique values in each column
print("\nUnique values:")
for column in customer_demo.columns:
    print(f"Column: {column}, Unique values: {customer_demo[column].nunique()}")

Unique values:
Column: customer_id, Unique values: 4000
Column: first_name, Unique values: 3139
Column: last_name, Unique values: 3725
Column: gender, Unique values: 6
Column: past_3_years_bike_related_purchases, Unique values: 100
Column: DOB, Unique values: 3448
Column: job_title, Unique values: 195
Column: job_industry_category, Unique values: 9
Column: wealth_segment, Unique values: 3
Column: deceased_indicator, Unique values: 2
Column: default, Unique values: 90
Column: owns_car, Unique values: 2
Column: tenure, Unique values: 22

In [21]:
customer_demo['gender'].value_counts()

Female    2037
Male      1872
U           88
F            1
Femal        1
M            1
Name: gender, dtype: int64

The gender column can be optimized. We can have Male, Female and Perhaps Others to account for those who identify otherwise.

## Customer Address Analysis

In [22]:
customer_address.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [23]:
customer_address.shape

(3999, 6)

In [25]:
# Check for missing values
print("Missing values:")
print(customer_address.isnull().sum())

Missing values:
customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

No missing value